cfe llm/InformationRegisters/AI_СекретыMCP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>AI_СекретыMCP</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Секрет</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.AI_MCPСерверы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe llm/CommonModules/AI_MCPСекреты/Ext/Module.bsl
Функция Получить(Знач Сервер) Экспорт

	Если Не ЗначениеЗаполнено(Сервер) Тогда
		Возврат "";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		| AI_СекретыMCP.Секрет КАК Секрет
		|ИЗ
		| РегистрСведений.AI_СекретыMCP КАК AI_СекретыMCP
		|ГДЕ
		| AI_СекретыMCP.Сервер = &Сервер";
	Запрос.УстановитьПараметр("Сервер", Сервер);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Или Выборка.Секрет = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Попытка
		Возврат Строка(Выборка.Секрет.Получить());
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции

Процедура Записать(Знач Сервер, Знач Секрет) Экспорт

	Если Не ЗначениеЗаполнено(Сервер) Тогда
		ВызватьИсключение "Не указан MCP-сервер.";
	КонецЕсли;

	Запись = РегистрыСведений.AI_СекретыMCP.СоздатьМенеджерЗаписи();
	Запись.Сервер = Сервер;
	Запись.Секрет = Новый ХранилищеЗначения(Строка(Секрет));
	Запись.ДатаИзменения = ТекущаяДатаСеанса();
	Запись.Записать();

КонецПроцедуры

Процедура Удалить(Знач Сервер) Экспорт

	Если Не ЗначениеЗаполнено(Сервер) Тогда
		Возврат;
	КонецЕсли;
	Запись = РегистрыСведений.AI_СекретыMCP.СоздатьМенеджерЗаписи();
	Запись.Сервер = Сервер;
	Запись.Удалить();

КонецПроцедуры
